[
  {
    "name": "Novità in 0.9.8",
    "items": [
      {
        "type": "1",
        "title": "Ora nel calendario è sempre visibile il giorno della settimana!"
      }, {
        "type": "2",
        "title": "Risolto un problema con qualche dispositivo in cui sparivano le lezioni durante gli aggiornamenti."
      }, {
        "type": "2",
        "title": "Risolto un problema che non permetteva di caricarsi al corso di Mediazione Linguistica 1° anno (e forse anche altri corsi)<br><strong>Grazie a Sara Vincis per la segnalazione!</strong>"
      }, {
        "type": "3",
        "title": "La notifica della prossima lezione non sparisce più quando si pigia sopra (può ancora essere eliminata con uno swipe)"
      }
    ]
  },{
    "name": "Novità in 0.9.7",
    "items": [
      {
        "type": "2",
        "title": "Corretti gli orari di alcune lezioni che erano erroneamente spostate in avanti.<br><strong>Grazie a Matteo Filippini e Alessandro Gerevini per le segnalazioni!</strong>"
      }, {
        "type": "2",
        "title": "Ora gli utenti con fuso orario non italiano non hanno più lo sfondo grigio nelle lezioni della prima settimana. <br><strong>Grazie a Zanna_37 per la segnalazione!</strong>"
      }, {
        "type": "3",
        "title": "Ora la disattivazione dell'aggiornamento delle lezioni funziona correttamente (prima non andava sempre)"
      }, {
        "type": "3",
        "title": "Corretti diversi problemi minori"
      }
    ]
  },{
    "name": "Novità in 0.9.6",
    "items": [
      {
        "type": "2",
        "title": "Risolto un errore mostrava le notifiche delle lezioni anche se queste erano disabilitate"
      }, {
        "type": "2",
        "title": "Risolto un errore che non rendeva le notifiche \"fisse\" anche se venivano impostate come tali nelle opzioni"
      }
    ]
  },{
    "name": "Novità in 0.9.5",
    "items": [
      {
        "type": "1",
        "title": "È ora possibile premere sulle lezioni per avere maggiori dettagli"
      }, {
        "type": "2",
        "title": "Nel filtro delle lezioni, le lezioni extra ora si distinguono con un asterisco dalle lezioni standard del corso"
      }, {
        "type": "3",
        "title": "L'app non viene più rallentata quando si cambiano i filtri delle lezioni"
      }, {
        "type": "3",
        "title": "L'intera app funziona ora più velocemente"
      }
    ]
  },{
    "name": "Novità in 0.9.0",
    "items": [
      {
        "type": "1",
        "title": "È ora possibile consultare gli orari delle biblioteche direttamente dall'app<br><strong>Grazie a Francesco Cadei per aver suggerito l'idea!</strong>"
      }, {
        "type": "2",
        "title": "Nella configurazione è ora possible modificare la dimensione del testo nel calendario"
      }
    ]
  },{
    "name": "Novità in 0.8.2",
    "items": [
      {
        "type": "1",
        "title": "Apportato qualche miglioramento grafico.<br><strong>Grazie a Miriam Punzi per il feedback!</strong>"
      }, {
        "type": "2",
        "title": "Corretto un errore che mostrava le notifiche per lezioni extra già rimosse<br><strong>Grazie a Simone Degiacomi per la segnalazione!</strong>"
      }, {
        "type": "2",
        "title": "Risolto un problema che faceva ritornare la notifica della prossima lezione una volta che questa era già stata rimossa<br><strong>Grazie a Davide Bulbarelli per la segnalazione!</strong>"
      }, {
        "type": "2",
        "title": "Corretto un errore che non mostrava tutte le notifiche delle prossime lezione quando si avevano orari extra senza aula"
      }, {
        "type": "3",
        "title": "Corretto un problema che all'apertura dell'app non faceva caricava le lezioni della giornata"
      }
    ]
  },{
    "name": "Novità in 0.8.1",
    "items": [
      {
        "type": "1",
        "title": "Aggiunta una sezione con la versione dell'app e gli ultimi miglioramenti apportati"
      },
      {
        "type": "3",
        "title": "L'app non crasha più quando si scorre il calendario a velocità folli"
      },
      {
        "type": "3",
        "title": "L'app è ora più stabile, specialmente sui dispositivi Samsung"
      },
      {
        "type": "3",
        "title": "Corretto qualche errore di battitura"
      }
    ]
  },
  {
    "name": "Novità in 0.8",
    "items": [
      {
        "type": "1",
        "title": "Rilasciata la prima beta di Trentastico!"
      }
    ]
  }
]